#pragma once
#include "os/AsyncTask.h"
#include "os/Timer.h"
#include "utl/PoolAlloc.h"

class Block {
public:
    Block();
    void UpdateTimestamp();

    bool CheckMetadata(int arknum, int blocknum) const {
        return mArkfileNum == arknum && mBlockNum == blocknum;
    }
    const char *Buffer() const { return mBuffer; }
    int ArkFileNum() const { return mArkfileNum; }
    int BlockNum() const { return mBlockNum; }
    int Timestamp() const { return mTimestamp; }
    void SetWritten() { mWritten = true; }
    bool Written() const { return mWritten; }

    MEM_OVERLOAD(Block, 0x16);
    static int CurrentTimestamp() { return sCurrTimestamp; }

private:
    static int sCurrTimestamp;

    const char *mBuffer; // 0x0
    int mArkfileNum; // 0x4
    int mBlockNum; // 0x8
    int mTimestamp; // 0xc
    bool mWritten; // 0x10
    const char *mDebugName; // 0x14
};

class BlockRequest {
public:
    BlockRequest(const AsyncTask &);

private:
    int mArkfileNum; // 0x0
    int mBlockNum; // 0x4
    const char *mStr; // 0x8
    std::list<AsyncTask> mTasks; // 0xc
};

class BlockMgr {
public:
    BlockMgr() {}
    ~BlockMgr() {}
    char *GetBlockData(int, int);
    void KillBlockRequests(ArkFile *);
    void Poll();
    void GetAssociatedBlocks(unsigned long long, int, int &, int &, int &);
    void AddTask(const AsyncTask &);
    bool SpinUp();
    void Init();
    void MarkDiscRead();

private:
    void WriteBlock();
    void ReadBlock();
    Block *FindBlock(int, int);
    Block *FindLRUBlock(bool); // Least Recently Updated
    Block *FindMRUBlock(); // Most Recently Updated

    std::list<BlockRequest> mRequests; // 0x0
    std::vector<Block *> mBlockCache; // 0x8
    Block *mReadingBlock; // 0x14
    Block *mWritingBlock; // 0x18
    Timer mSpinDownTimer; // 0x20
};

extern BlockMgr TheBlockMgr;
